app/controllers/auth/registrations_controller.rb

  def create
    super do |user|
      if User.count == 1
        user.update(role: 'admin')
---
SELECT COUNT(*) FROM "users"
UPDATE "users" SET "updated_at" = ?, "role" = ? WHERE "users"."id" = ?  [["updated_at", "2023-08-30 20:04:24.252623"], ["role", 1], ["id", 1]]

  def create_profile(user)
    first_name, last_name = user.name.split(' ', 2) # Split the name into two parts

    Profile.transaction do
      profile = Profile.create(
        user: user,
        first_name: first_name, # Set first_name from the split name
        last_name: last_name,   # Set last_name from the split name
        bio: 'Default bio',
        nickname: user.nickname,
        image: user.image
      )
---
INSERT INTO "users" ("uid", "encrypted_password", "name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "profiles" ("user_id", "first_name", "last_name", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 22], ["first_name", "John"], ["last_name", "Doe"], ["bio", "Default bio"], ["created_at", "2023-08-22 20:33:48.804044"], ["updated_at", "2023-08-22 20:33:48.804044"]]