app/controllers/comment_likes_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comment_likes" ("user_id", "comment_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["comment_id", 1], ["created_at", "2023-08-22 15:02:27.085842"], ["updated_at", "2023-08-22 15:02:27.085842"]]
---
    def like
      comment = Comment.find(params[:comment_id])
      comment_like = comment.comment_likes.create(user: current_user)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comment_likes".* FROM "comment_likes" WHERE "comment_likes"."comment_id" = ? AND "comment_likes"."user_id" = ? LIMIT ?  [["comment_id", 1], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "comment_likes" WHERE "comment_likes"."id" = ?  [["id", 1]]
---
    def dislike
      comment = Comment.find(params[:comment_id])
      like = comment.comment_likes.find_by(user: current_user)
      like.destroy if like