app/controllers/post_likes_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "post_likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["post_id", 1], ["created_at", "2023-09-12 07:42:39.628027"], ["updated_at", "2023-09-12 07:42:39.628027"]]
SELECT COUNT(*) FROM "post_likes" WHERE "post_likes"."post_id" = ?  [["post_id", 1]]
---
  def like
    post = Post.find(params[:post_id])
    post_like = post.post_likes.create(user: current_user)

    if post_like.persisted?
      like_count = post.post_likes.count

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "post_likes".* FROM "post_likes" WHERE "post_likes"."post_id" = ? AND "post_likes"."user_id" = ? LIMIT ?  [["post_id", 1], ["user_id", 2], ["LIMIT", 1]]
DELETE FROM "post_likes" WHERE "post_likes"."id" = ?  [["id", 123]]
---
  def dislike
    post = Post.find(params[:post_id])
    like = post.post_likes.find_by(user: current_user)
    like.destroy if like