app/controllers/posts_controller.rb

    def index
      @posts = Post.all

      respond_to do |format|
        format.json do
          # Create an array to store the JSON representation of each post
          posts_data = []
          @posts.each do |post|
            post_data = post.as_json
            if post.image.attached?
              post_data["image_url"] = rails_blob_path(post.image, only_path: true)
            end
            posts_data << post_data
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id", "category_id") VALUES (?, ?, ?, ?, ?, ?)

    def category_posts
      category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def show
      @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
      @post = current_user.posts.build(post_params)

      if @post.save
        # Handle image attachments if they are present
        if params[:post][:images].present?
          params[:post][:images].each do |image|
            @post.image.attach(image)
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "post 2"], ["content", "this is my first post"], ["created_at", "2023-08-21 21:59:59.146221"], ["updated_at", "2023-08-21 21:59:59.146221"]]

  def like_dislike_counts
    @post = Post.find(params[:post_id])
    likes_count = @post.post_likes.count
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT COUNT(*) FROM "post_likes" WHERE "post_likes"."post_id" = ?  [["post_id", 1]]