app/controllers/posts_controller.rb

    def index
      @posts = Post.all

      respond_to do |format|
        format.json do
          # Create an array to store the JSON representation of each post
          posts_data = []
          @posts.each do |post|
            post_data = post.as_json
            if post.image.attached?
              post_data["image_url"] = rails_blob_path(post.image, only_path: true)
            end
            posts_data << post_data
---
SELECT "posts".* FROM "posts"
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id", "category_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "tttttt"], ["content", "uheeebecbe"], ["created_at", "2023-09-03 01:11:03.095637"], ["updated_at", "2023-09-03 01:11:03.095637"], ["user_id", 4], ["category_id", 1]]

    def category_posts
      category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def show
      @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def create
      @post = current_user.posts.build(post_params)

      if @post.save
        # Handle image attachments if they are present
        if params[:post][:images].present?
          params[:post][:images].each do |image|
            @post.image.attach(image)
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id", "category_id") VALUES (?, ?, ?, ?, ?, ?)

    def edit
      @post = current_user.posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
      @post = current_user.posts.find(params[:id])

      if @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2023-09-03 14:34:33.220793"], ["id", 2]]

    def likes
      post = Post.find(params[:id])
      likes_count = post.post_likes.count
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "post_likes" WHERE "post_likes"."post_id" = ?  [["post_id", 2]]

    def dislikes
      post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]