app/controllers/posts_controller.rb

    def show
      @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
      @post = current_user.posts.find(params[:id])

      if @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2023-09-03 13:51:34.249887"], ["id", 11]]